In [1]:
import pandas as p

In [51]:
import numpy as n

In [3]:
m

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
m1=p.Series(1)

m1

In [6]:
m1

0    1
dtype: int64

In [21]:
m1=p.Series([1,2,3,4,5],index=list('abhay'))

In [22]:
m1

a    1
b    2
h    3
a    4
y    5
dtype: int64

In [23]:
m1.idxmax()

'y'

In [24]:
m1.idxmin()

'a'

# dataframe

In [25]:
a=p.DataFrame()
b=p.DataFrame([1,2,55,40,86])
c=p.DataFrame([[1,2,3],[10,20,15],[11,22,33]])

In [26]:
a

Empty DataFrame
Columns: []
Index: []

In [27]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [28]:
c

    0   1   2
0   1   2   3
1  10  20  15
2  11  22  33

In [69]:
d=p.DataFrame([[1,1,1,1,1,1,1],[2,2,2,n.nan,2,2,2],[3,3,3,3,3,3,3],[4,4,4,4,4,4,4],[5,5,5,5,5,5,5],[6,6,6,6,6,6,6],[7,7,7,7,7,7,7]],columns=['a','b','c','d','e','f','g'])

In [70]:
d

   a  b  c    d  e  f  g
0  1  1  1  1.0  1  1  1
1  2  2  2  NaN  2  2  2
2  3  3  3  3.0  3  3  3
3  4  4  4  4.0  4  4  4
4  5  5  5  5.0  5  5  5
5  6  6  6  6.0  6  6  6
6  7  7  7  7.0  7  7  7

In [74]:
d.head(1)

   a  b  c    d  e  f  g
0  1  1  1  1.0  1  1  1

In [40]:
d.tail(1)

   0  1  2  3  4
4  5  5  5  5  5

In [41]:
d.sample(2)

   0  1  2  3  4
2  3  3  3  3  3
3  4  4  4  4  4

In [46]:
d

   0    1  2  3  4
0  1    1  1  1  1
1  2  Nan  2  2  2
2  3    3  3  3  3
3  4    4  4  4  4
4  5    5  5  5  5

In [77]:
d['a'].max()

7

In [78]:
d['a'].head(2)

0    1
1    2
Name: a, dtype: int64

In [79]:
d['a']

0    1
1    2
2    3
3    4
4    5
5    6
6    7
Name: a, dtype: int64

In [80]:
d.shape

(7, 7)

In [90]:
d['h','a']=d['a']+d['d']

In [91]:
d

   a  b  c    d  e  f  g  h  (h, 1)  (h, a)
0  1  1  1  1.0  1  1  1  1       1     2.0
1  2  2  2  NaN  2  2  2  2       2     NaN
2  3  3  3  3.0  3  3  3  3       3     6.0
3  4  4  4  4.0  4  4  4  4       4     8.0
4  5  5  5  5.0  5  5  5  5       5    10.0
5  6  6  6  6.0  6  6  6  6       6    12.0
6  7  7  7  7.0  7  7  7  7       7    14.0

In [92]:
d['d']=[1,2,3,4,5,6,7]

In [93]:
d

   a  b  c  d  e  f  g  h  (h, 1)  (h, a)
0  1  1  1  1  1  1  1  1       1     2.0
1  2  2  2  2  2  2  2  2       2     NaN
2  3  3  3  3  3  3  3  3       3     6.0
3  4  4  4  4  4  4  4  4       4     8.0
4  5  5  5  5  5  5  5  5       5    10.0
5  6  6  6  6  6  6  6  6       6    12.0
6  7  7  7  7  7  7  7  7       7    14.0